[
  {
    "name": "Ain’t That Loving You",
    "artist": "Alton Ellis",
    "description": "Original 12” inch is the only way to go in this case. The 45 pressing of this song has surface noise and minor pops and crackles. The 12” is still your average pressing compared to most Studio One 12 inches, fidelity wise, but has a really fantastic extended mix with a great dub. Nice slow burner to get things started, I have opened many sets with this record over the years.",
    "photo": "img/1.jpg",
    "year": "1978"
  },
  {
    "name": "Nanny Goat",
    "artist": "Larry Marshall",
    "description": "All time Jamaican smasher, a transitional point from rocksteady to reggae. The 12” mix is beefed up a bit with just the right overdubs. I almost always prefer the original version to the overdubs but this one is hot, some day time party/bbq type shit. The 45 mix is different and is the classic version. As far as the 45, I would go with the the original Supreme pressings. The 45 on Supreme is loud but has surface noise and imperfections.",
    "photo": "img/25.jpg",
    "year": "1979"
  },
  {
    "name": "Get Ready",
    "artist": "Burning Spear",
    "description": "I don’t know what happened in relation to the early Burning Spear material for Coxsone.  Almost all of the original pressings, LP or 45, involving Burning Spear, sound like shit and have varying levels of pressing hiss or background noise. Best listened to on Soul Jazz’s retrospective, as is all the Burning Spear material, “Get Ready” is among the better 45s, quality wise, but not great. It’s passable over a loud sound system. This is the original pressing. There is also a similar era pressing on label variant “Coxson” of similar quality using the same stampers.",
    "photo": "img/78.jpg",
    "year": "1975"
  },
  {
    "name": "A Love I Can Feel",
    "artist": "John Holt",
    "description": "Foundation Studio One track. I have djed all three of the early 45 pressings over the years, the two Coxsone pressings and the UK Bamboo pressing. All sound OK but are rough and ready, with occasional noise. This is a clean Coxsone 70s second press that sounds pretty similar to the original pressings, same stampers.",
    "photo": "img/49.jpg",
    "year": "1970"
  },
  {
    "name": "Africa Here I Come",
    "artist": "Freddie Mcgregor",
    "description": "For years I djed the 80s and 90s 45 pressings of this. The black and white 90s 45 pressing isn’t very good and neither is the 80s Rosette copy but you can play them out if that’s all you got. They sound decent but have a fair amount of crackling from the press. This 10”on Music Lab sounds good though with minimal to no pressing noise. Also on Studio One Roots (Soul Jazz) which is widely considered to be a landmark reissue.",
    "photo": "img/151.jpg",
    "year": "1980"
  },
  {
    "name": "I've Got To Go Home",
    "artist": "Bob Andy",
    "description": "The best way to listen to this Bob Andy masterpiece is on the Studio One 12”. I’ve DJed a couple copies of the first pressings of this tune on 45,which are loud but have surface noise. The Island UK pressing has more noise than the Jamaican Coxsone pressing. None sound as good as the 12”.",
    "photo": "img/20.jpg",
    "year": "1977"
  },
  {
    "name": "Going Home",
    "artist": "Bob Andy",
    "description": "My favorite Bob Andy tune of all time, top shelf Studio One! For years I DJed this tune off the full length, “Bob Andy’s Song Book”. The best pressing of that album by far is the yellow and red early 80s NYC pressing. It took me years to find the 45, which I play out now over the LP. The 45 plays with slight surface noise. The other 70s pressing on the green Coxson label plays very similar, if not the same. I also have a Muzik City blank which is similar. The UK pressing plays with less noise than any of the original Jamaican pressings in this case but doesn’t knock like the Jamaican pressing does.",
    "photo": "img/80.jpg",
    "year": "1969"
  },
  {
    "name": "I Don't Know",
    "artist": "Freddie McGregor",
    "description": "Deep, dark, early Freddie McGregor over the “Just Say Who” riddim, in bad need of a repressing of any sort! Similar to many of the Money Disc pressings of this time period, soft sounding and too much pressing noise. I don’t play this out because of the pressing quality. Day time roots party material only.",
    "photo": "img/96.jpg",
    "year": "1975"
  },
  {
    "name": "Peace True Thing",
    "artist": "DJ Dawn and The Ranking Queens",
    "description": "One of my go-to tracks over the past few years. Murderous cut flipping “I’m Still In Love With You”. Soul Jazz’s “Studio One Dancehall” is by far the best way to hear this record. The original pressing has odd defects and press bubbles, background noise, and does not sound as good or loud as the repress on Soul Jazz. Once I got “Studio One Dancehall” I started playing this one out all the time because I finally had a good pressing of this monster tune.",
    "photo": "img/7.jpg",
    "year": "1978"
  },

  {
    "name": "Unity",
    "artist": "Johnny Osbourne",
    "description": "Top ranking late era Studio One, 80s vibes. Super slept on, never repressed or compiled, and only available on this original 12”. Once the record goes into the dub there is some noticeable pops but the vocal is generally of higher quality pressing wise.",
    "photo": "img/42.jpg",
    "year": "1981"
  },

  {
    "name": "Mr. Bassie",
    "artist": "Horace Andy",
    "description": "Recently repressed by Soul Jazz on 45, which sounds clean on thick vinyl. I prefer the extended 12” mix. This Italian bootleg sounds good. Discogs also lists a US Winro reissue but I believe all the “Winro” reissues after 2000 were high quality Italian bootlegs. Foundation riddim.",
    "photo": "img/24.jpg",
    "year": "1978"
  },

  {
    "name": "Pearl",
    "artist": "Alton Ellis",
    "description": "One of the rarest Studio One 12” inches of all time. Never repressed and not available elsewhere. “Pearl” is a criminally overlooked Alton Ellis tune, one of my top Alton tunes. This extended mix of Pearl is dope. One of my top Studio One sides of all time. I have thrashed this over the years. Before I had the 12”, I played it out off the Alton Ellis “Best Of” on Studio One. The red and yellow 80s NYC pressing is the best way to go for that LP, but the 12”is much louder and sounds better at a party.",
    "photo": "img/28.jpg",
    "year": "1969"
  },
  {
    "name": "Queen Of The Minstrel",
    "artist": "Cornell Campbell",
    "description": "There is a variety of 45 pressings of this song but none sound as good as the 12”. The 12” sounds excellent. A good quality US 12” inch pressing of Studio One, this is as good as it gets.  On “Studio One Soul” by Soul Jazz the tune also sounds good, but the original 12” is the one.",
    "photo": "img/31.jpg",
    "year": "1982"
  },
  {
    "name": "I Shall Be Released",
    "artist": "Freddie Mcregor",
    "description": "dOne of the Studio One records I’ve played the most over the years and one of the best extended mixes the label’s ever done. For years I Djed it off the “Studio One Kings” LP by Soul Jazz, which sounds good, but then I got a copy of the original 12” which sounds amazing! The 45 is a missed opportunity as it breaks the song in half over each side, but is a good pressing. I have played this  at literally every occasion you can think of from weddings to  funerals, a very potent record.",
    "photo": "img/35.jpg",
    "year": "1977"
  },
  {
    "name": "Roots Natty",
    "artist": "Gladiators",
    "description": "The original pressing of this 45 and any subsequent repress sound like they were pressed in the same garbage dump as the Burning Spear material. What a shame as this is a slow burner. Pressed low and hissy on 45. Best played off the Heartbeat compilation, “Best of Studio One”, the original 45 pressing is barely playable at home.",
    "photo": "img/139.jpg",
    "year": "1975"
  },
  {
    "name": "Behold",
    "artist": "Culture",
    "description": "An all time roots scorcher. A favored tune of mine over the years. I never could afford the 45 pressing so I used to play it off, “Studio One Roots 2”. The original pressing of the 45 sounds decent and comes with a high price tag when it shows up on auction. Soul Jazz repressed the 45, a high quality pressing with a different b-side.  About 3 years ago I found this 12” and realized I like the 12” mix even better. One of my top ten Studio One 12” inches.",
    "photo": "img/3.jpg",
    "year": "1978"
  },
  {
    "name": "Roots Natty",
    "artist": "Devon Russel",
    "description": "The original 45 of this sounds super clean. I usually play it instead of the Gladiators version as it sounds so much better and can be played out. The tune also sounds good on “Studio One Kings” by Soul Jazz.",
    "photo": "img/140.jpg",
    "year": "1981"
  },
  {
    "name": "Hooligan (Change Your Style)",
    "artist": "John Holt",
    "description": "The 12” mix is the way to go, as this is one of my favorite Studio One dubs ever. I played the dub off of the original 45 pressing for years at many house parties. Heartbeat put the 12” mix on their John Holt compilation, “I Can’t Get You Off My Mind”, which is amazing and compiled all his best Studio One material. The sound quality is excellent. “Hooligan” sounds better on the Heartbeat compilation than the original pressing.",
    "photo": "img/18.jpg",
    "year": "1978"
  },
  {
    "name": "Heavy Dub",
    "artist": "Sound Dimension",
    "description": "I picked up the original pressing of this about 10 years ago and have DJed it exclusively ever since. It’s on the higher end of quality for 70s Coxsone pressings. I didn’t realize how ill the dub was and had never heard the dub mix before I got this one on 45. “Heavy Rock” is the foundation riddim but “Heavy Dub” is the side I have always preferred.",
    "photo": "img/84.jpg",
    "year": "1976"
  },
  {
    "name": "Every Man A Mi Bredren",
    "artist": "Brigadier Jerry",
    "description": "I have always played the original 12” and it sounds banging. A mini set of Brigadier Jerry will always get people moving. One of the most influential Jamaican DJs of all time forwarding the Soul Vendors’ “West Of The Sun.” The Music Lab pressing is superior to the  Studio One pressing but both sound good on a loud sound system.",
    "photo": "img/10.jpg",
    "year": "1983"
  },
  {
    "name": "Equal Rights",
    "artist": "The Heptones",
    "description": "One of the Heptones seminal songs. This 12” mix has never been compiled and is the only place you can find the extended cut with Jah Buzz. I believe the overdubbed drumming is Freddie McGregor. I played “Equal Rights” off the LP for a long time and it wasn’t the greatest but it worked if I turned it up a bit to compensate. Since I’ve gotten this original pressing, I’ve run it out exclusively. Good pressing.",
    "photo": "img/9.jpg",
    "year": "1978"
  },
  {
    "name": "Time A Run Out",
    "artist": "Johnny Osbourne",
    "description": "Before Soul Jazz reissued this on the recent “Studio One Dancehall” compilation , this was a tough tune to find on the Hot Milk riddim. It was only available on a 12” pressing until Soul Jazz went on to reissue it in 2016, but without the original b-side (Jim Brown’s “Pressure”) which was a shame. “Studio One Dancehall” is one of the better pressings of any of the Soul jazz compilations spread out over three LPs and sounds good loud. I still play the original pressing because then it puts “Pressure” in my box.",
    "photo": "img/38.jpg",
    "year": "1983"
  },
  {
    "name": "My Satisfaction",
    "artist": "Paragons",
    "description": "The holy grail pressing of this song is the UK Coxsone blue label, mainly because it pairs Lester Sterling’s “Afrikaan Beat” on the b-side. High on my want list for years, I was a bit disappointed when I finally sourced a copy and there was hiss on the “My Satisfaction” side.  I owned the blue Supreme pressing and traded it at one point. It is subpar for DJing as it also has considerable pressing noise and distortion. The 12” pressing is a lot better but still has that same annoying hiss to varying degrees. I gave up and just play the HeartBeat compilation of John Holt’s Studio One material. The 12” mix is on there and sounds really good loud.",
    "photo": "img/18.jpg",
    "year": "1977"
  },
  {
    "name": "Happy Man",
    "artist": "The Gladiators",
    "description": "This is another Italian 2000s Winro bootleg, which like most of them plays surprisingly decent, although it does have very minor pressing noise at times, but so does the original Studio One pressing. I actually find the pressing noise much more annoying on the original pressing.  Deep Gladiators crusher right here. The song is also present on Heartbeat’s excellent but out of print “Studio One Singles” compilation of all the Gladiators material at Brentford Road.",
    "photo": "img/13.jpg",
    "year": "1979"
  },
  {
    "name": "How Could I Live",
    "artist": "Sharks",
    "description": "The 45 of this song frustrates me because it’s just a little too slow to get people moving, but this later 12” mix is not too heavy on the overdubs, just enough for the dancehall. This mix has never let me down.  It has never been repressed or compiled, it is crucial. Serious warm up tune. As far as the 45 pressings of the slower version of this song the original UK red and white label pressing is very expensive and has more distortion and static than the Jamaican 70s pressing of which the Coxsone label I played for years and it sounds good.  70s Coxsone pressing with text on both side of the label is the best. The original two Jamaican pressings of this song use a different stamper and have pressing noise on top of the music.",
    "photo": "img/15.jpg",
    "year": "1968"
  },
  {
    "name": "Time Is Getting Hard",
    "artist": "Hubert Lee",
    "description": "One of the most criminally slept on Studio One songs.  I have never heard anyone else play this song out before. I consider it one of “my” sound system’s tunes. It is on some long road shit. This is the original 45 pressing.  It has never been relived in any format. Top shelf roots music. Decades later it is still very current.",
    "photo": "img/169.jpg",
    "year": "1977"
  },
  {
    "name": "Strange Things",
    "artist": "John Holt",
    "description": "I waited years to get this on 45. Coxsone’s “Tranquility” pressings can be a motherfucker to find.  This comes up on eBay every year or two. The pressing is good and it has the instrumental on the b-side which is hot. An easier clean way to play this is also off the John Holt Studio One compilation on Heartbeat.  This Coxsone mix is subtly different than the more common Phil Pratt Sunshot production. Average sound quality on the press.",
    "photo": "img/159.jpg",
    "year": "1971"
  },
  {
    "name": "Throw Mi Corn (Ver.)",
    "artist": "Larry Marshall And Sound Dimension",
    "description": "When in doubt always go red and yellow NYC label. I prefer this ‘80s pressing even to the original pressing. This is a classic but I have played it sparingly over the years. I usually run the version on the b-side. The riddim is a favorite of mine and a nice warm up tune.",
    "photo": "img/168.jpg",
    "year": "1973"
  },
  {
    "name": "Death In The Arena",
    "artist": "Soul Vendors",
    "description": "If I’m going to be playing for a while and have time to stretch out I will play 40 minutes or so of classic Studio One riddims. This one is always right in there. The “Death In the Arena” riddim shows up multiple times in Coxsone productions over the years but this is the best way to hear it.  Plus you get the extended cut of “Equal Rights” with the DJ cut on the flip side. Heartbeat repressed their compilation of Studio One instrumentals, “Downbeat The Ruler” on a fat double lp and included this extended mix.  Sounds clean, too. Chris from Heartbeat always used the master tapes when possible.",
    "photo": "img/154.jpg",
    "year": "1978"
  },
  {
    "name": "Take A Ride",
    "artist": "Al Campbell",
    "description": "This is the best 45 pressing.  The original black and white Studio One label pressing has more noise to me.  The 45 mix can be played off the compilations “Studio One Roots 2” (Soul Jazz ) or “When Rhythm Was King” (HeartBeat). Also on a very coveted 12” edition (goes for 200-300 dollars on auction) with a more dubby uptempo mix but much poorer sound quality.",
    "photo": "img/162.jpg",
    "year": "1973"
  },
  {
    "name": "Ram Dance Master",
    "artist": "Brigadier Jerry",
    "description": "Brigadier Jerry truly was the ram dance master, he wasn’t fucking around. One of the pinnacles of 80s Jamaican toasting for me. Crucial DJ cut reissued on “Studio One DJ’s 2” by Soul Jazz which sounds good, but I have played the 12” many times and it sounds good.  Never had a reason to switch it up. Not an easy record to find on the original 12”.",
    "photo": "img/32.jpg",
    "year": "1983"
  },
  {
    "name": "Thanks And Praise",
    "artist": "Devon Russel",
    "description": "I first heard this song on a tape of an 80s Shaka session and knew right away I needed this piece of Studio One 80s roots. The 45 pressing sounds alright, it’s not quiet and has a bit of pressing noise, but it is passable. Sounds better on “Studio One Dancehall” ( Soul Jazz).",
    "photo": "img/165.jpg",
    "year": "1981"
  },
  {
    "name": "Truth And Rights",
    "artist": "Johnny Osbourne",
    "description": "Very nice repressing from Soul Jazz in 2015, a preferred DJ copy. This roots classic also sounds good on the original US pressing of  the “Truth and Rights” full length. There is an 80s repress with the red or black Rosette Studio One label of the LP that sounds good and is cheaper, the original US pressing is expensive.",
    "photo": "img/173.jpg",
    "year": "1979"
  },
  {
    "name": "Armageddon Time",
    "artist": "Willie Williams",
    "description": "Old punk rockers favorite right here. The “Real Rock” riddim always gets people moving, really shining over the years in house party situations for me. This 12” mix is my favorite cut of “Real Rock” ever, the extended mix is just insane, keeps people going until the end. A serious floor filler.  Also pressed nicely on “Studio One Disco Mix” and on a 45 repressing by Soul Jazz.",
    "photo": "img/2.jpg",
    "year": "1979"
  },
  {
    "name": "My Man Is Gone",
    "artist": "Aneglia Prince",
    "description": "Should have been included on Soul Jazz’s “Studio One Women” compilation.  A really well done female answer piece is a thing of beauty. Only available on this 45, which is a good NYC pressing.",
    "photo": "img/115.jpg",
    "year": "1980"
  },
  {
    "name": "I Am The Ruler",
    "artist": "Anthony Rocky Ellis",
    "description": "Rocky Ellis was the precursor to guys like Banana Man, specializing in sound clash devastation related releases. This is a rough and tough record that I have played many, many times over the years. This US 45 pressing sounds good, but can be expensive when you find a copy. The black text, white label repress from the same era (1978) uses the stamper, which also is a good DJ copy.  Originally from 1968 with a new mix laid down and first issued in the late 70's (with percussion & keyboard overdubs). The original mix is present on the red and white UK issue from the late 60s and a Jamaican issue from the same time. I tried Djing it a few times years ago and I hated the way it sounded loud, has that odd piercing quality some UK pressings of this time period have. I much prefer the 70s mix of this top tune. The Jamaican Coxsone pressing is also comparable but warmer and better sounding to the UK ‘60s pressing. “The Ruler” is easily DJed off the “Studio One Kings” compilation on Soul Jazz which sounds solid.",
    "photo": "img/95.jpg",
    "year": "1968"
  },
  {
    "name": "I Was Born To Be Loved",
    "artist": "Righteous Flames",
    "description": "Certain record stores would never let me bring a portable record player in (always hated that about Amoeba!) or I was scared if I did bring it out someone would yoke me for it. So I guessed, based on how cool the names of artists sounded, by necessity sometimes, always passing on the Righteous Flames material because it sounded like some gospel kind of shit. I kicked myself years later for that. A few years ago I finally got this tune on 12”, a friend of Albert Malawi, longtime operator of the Jahlovemuzik sound system, was selling some of his records so I bought a few including this record. It is an honor to play them. If you are looking to acquire this song on the 45, the Jamaican blank is the choice pressing, but is expensive and highly coveted. However all 45 pressings, especially the 1970s pressings of this song, have varying levels of hiss on them.",
    "photo": "img/150.jpg",
    "year": "1977"
  },
  {
    "name": "Hot Milk",
    "artist": "Jackie Mittoo",
    "description": "Oddly, I prefer the Coxson pressing to the sound of the usually superior UK Banana pressing, though both have minimal pressing/surface noise. Also plays clean off of “Studio One Rockers” (Soul Jazz). Many burners on that compilation and pressed well.",
    "photo": "img/89.jpg",
    "year": "1977"
  },
  {
    "name": "Real Rock",
    "artist": "Sound Dimension",
    "description": "I got this original pressing a few years ago from Ernie at Ernie B. He told me it was the best pressing of the tune and he was right. Ernie doesn’t fuck around and like me, loves some good rough and rugged Jamaican style mixing and mastering. Only some slight noise and plays loud. I have Djed it ever since.",
    "photo": "img/133.jpg",
    "year": "1978"
  },
  {
    "name": "Can I Change My Mind",
    "artist": "Alton Ellis",
    "description": "Heartbeat did some really nice work with the Studio One catalog.  I wish they had continued reissuing more of the extended 12” mixes Coxsone put out in the late 70s and early 80s. The only compilation of 12” mixes Heartbeat put out, “Nice Up The Dance”, was really good. The cover was hideous and the name couldn’t have been more boring, but it was a quality release. That is the easiest place to find this disco mix of “Can I Change My Mind” but the original pressing sounds very good, prime for playing out. The original JA 45 pressings of this song are on the high end of Studio One quality.",
    "photo": "img/4.jpg",
    "year": "1968"
  },
  {
    "name": "Love In The Dance Pt. 2",
    "artist": "Brentford Rockers",
    "description": "I never much liked Jim Brown’s Dj cut on the A-side, I own and have packed this record for gigs and parties for years because the riddim it’s on, “Shank I Sheck”, is a pillar of any sound system session. Beyond a classic riddim, it’s ingrained into Jamaican culture at this point. To have the Studio One lick of a riddim of this magnitude in your box is crucial. Very nice pressing.",
    "photo": "img/107.jpg",
    "year": "1981"
  },
  {
    "name": "Call On You",
    "artist": "Burning Spear",
    "description": "My favorite Burning Spear song of all time, a personal anthem of mine, I have played this endless amounts of times over the years on any format I can get my hand on. Again most of the Burning Spear material for Coxsone is awfully pressed, especially the initial runs, but  this 45 is of surprisingly good quality, workable. Again the song sounds best on Soul Jazz or Heartbeat’s Studio One Burning Spear retrospectives, which are both unfortunately out of print, but either is worth acquiring for superb presentation and sound quality.",
    "photo": "img/54.jpg",
    "year": "1974"
  },
  {
    "name": "Money Problem",
    "artist": "Devon Russell",
    "description": "This is a deep Studio One 12”, never compiled or repressed. Hard cut on the immortal “Darker Shade of Black”. Late era Coxsone production, 80s vibes. Loud pressing you would expect on a good quality Studio One 12.",
    "photo": "img/23.jpg",
    "year": "1985"
  },
  {
    "name": "Bobby Babylon",
    "artist": "Freddie McGregor",
    "description": "The full length this album hails from of the same namesake is considered by many to be a landmark album. Pressed many ways over the years, the reissues of the full length sound good. I never rated the full length as high as some people, give me a 45 of this and “Rastaman Camp” and I’m good. As far as this song itself go with the red and yellow NYC label pressing for listenability, nice pressing with plenty of bass.",
    "photo": "img/52.jpg",
    "year": "1979"
  },
  {
    "name": "My Guiding Star",
    "artist": "Joe White",
    "description": "A deep cut I’ve played many times over the years, it is a personal favorite of mine. The songwriting is excellent. Over the “Love Me Forever” riddim, all pressings are average with slight noise, among the various 70s and 80s Coxsone pressings, which all use the same stamper. This early 80s pressing sounds better the the original Jamaican pressing on a Muzik City blank, same with the black Coxsone pressing of this same time period, both are not cheap either.",
    "photo": "img/114.jpg",
    "year": "1968"
  },
  {
    "name": "Can’t Get Enough",
    "artist": "Richard Ace",
    "description": "This ace reworking of the Barry White classic is one of my favorite Studio One soul covers. Compiled on Soul Jazz’s “Studio One Soul” compilation, I have never found a situation where I can’t play the whole record front to back. I used to take the ferry from New London to Long Island and would listen to this LP on repeat when I was younger, it was a revelation. This Richard Ace tune sounds good on that compilation as well as this second pressing 45, shown here. This second pressing is on par with the first.",
    "photo": "img/55.jpg",
    "year": "1974"
  },
  {
    "name": "I’ll Give It To You",
    "artist": "Tonettes",
    "description": "I first heard this song when “Studio One Women” came out in 2005. That LP is the only other place to find this song with the extended dub, other than this original 12”, which sounds good and I have played out for years now. Very good disco mix on this one and a better pressing than the UK Coxsone 45 from 1968, which plays pretty good but has surface noise.",
    "photo": "img/179.jpg",
    "year": "1968"
  },
  {
    "name": "Won’t Give Up",
    "artist": "Ethiopian",
    "description": "I don’t rate many Coxsone produced full lengths very highly, most of the time I just want to hear the singles without the extra filler songs. That is not the case with Leonard Dillon’s masterwork, “Everything Crash”. One of my favorite records ever, unbelievable lyrical content, delivery, and riddims. All of the early 80s pressings are pretty similar and pretty good, all pressed from the same stampers.",
    "photo": "img/152.jpg",
    "year": "1980"
  },
  {
    "name": "Rougher Yet",
    "artist": "Slim Smith",
    "description": "Straight to all downpressors’ heads! What a tune, hyper relevant decades later. Every pressing of this, I have owned most, has pressing hiss which is a shame for a tune this hard. Even the expensive UK 60s Coxsone pressing has bad surface hiss. At first I thought Soul Jazz clearly ripped the vinyl for “Studio One Classics” as the hiss is still present, but then I heard “Best of Studio One 2” on Heartbeat and they were always credited for using master tapes and the hiss is still there.",
    "photo": "img/33.jpg",
    "year": "1967"
  },
  {
    "name": "Darker Shade Of Black",
    "artist": "Soul Vendors",
    "description": "This UK pressing was released on a Coxsone blue label. Credited on this pressing to Jackie Mittoo as “Norwegian Wood”, the riddim is based on the Beatles song of the same namesake. This is by far the best pressing of this song. I’m listing it as the more common titling “Darker Shade of Black” as all other pressings use this title. The early Jamaican pressings with the Gaylads on the flipside are pretty rough quality, plenty of surface noise on those. The later 70s Jamaican pressings utilize the UK stamper and are a better bet for playing out, but do have background hiss.  One of my favorite foundation riddims of all time, later redone by The Roots Radics for Frankie Paul’s colossal dancehall anthem, “Pass the Tu Sheng Peng”.",
    "photo": "img/120.jpg",
    "year": "1967"
  },
  {
    "name": "Miss Haite Taite",
    "artist": "Westmorelites",
    "description": "This was my most wanted 45 for a long time, for years I have DJed it off the “Ride Me Donkey” compilation. This 45 sounds really good loud, a clean pressing. I prefer the Jamaican pressing over the UK because it sounds warmer, is louder, and plays with less noise.  I now DJ the 45 out. Very hard to find and will cost a few hundred dollars in even rough shape unless you get lucky.  I prefer this pressing with the Gaylads on the other side than the pressing which has Mr Foundation on the b-side even though they both use the same stamper. My favorite Studio One song of all time.",
    "photo": "img/113.jpg",
    "year": "1968"
  },
  {
    "name": "Dance In A Montreal",
    "artist": "Brigadier Jerry",
    "description": "This was one of the first Studio One 12 inches I owned. My mother, an old time Studio One fan gave it to me for Christmas one year, I’ve owned this record since I was 19.  It never fails in a party situation, my favorite cut on the “Diseases” riddim. Hard to have a proper reggae house party without at least one tune on “Diseases”. A very slept on track  and the pressing is good and loud. The Studio One and Music Lab pressings are both from the same time period roughly and use the same stamper.",
    "photo": "img/8.jpg",
    "year": "1985"
  },
  {
    "name": "Jah Promise",
    "artist": "Johnny Osbourne",
    "description": "Album only cut, Heartbeat put this on their “Best of Studio One” compilation, which has excellent remastered sound quality and is easy to find. I run this off the original US pressing from the “Truth and Rights” LP. The Rosette label pressing is also good to play out.",
    "photo": "img/144.jpg",
    "year": "1979"
  },
  {
    "name": "Mellow Mood",
    "artist": "Roland Alphonso",
    "description": "Deep Roland cut over a riddim based on the Guess Who’s “These Eyes.” This is the UK pressing from 1971 which is a bit rough around the edges like the Jamaican pressing, but a bit louder and with a different b-side, an old ska tune by the Maytals. Both Jamaican issues from this time period have the same matrix number and stamper.",
    "photo": "img/110.jpg",
    "year": "1971"
  },
  {
    "name": "Ya Ho",
    "artist": "Viceroys",
    "description": "I have owned and played this roots cut off a few early 45 pressings for many years but none of them sound that great, the Jamaican original pressing (usually a blank) and the UK pressing would be top picks. This 12” is much better. I have both pressings of the 12”, both from Jamaica according to Discogs. It seems like this is a US pressing by the label.  It sounds clean, both this or the other pressing do have light noise. The other version, the Jamaican 1980 pressing is louder but has a defect which skips on the version. Either copy routinely sells for a couple hundred dollars when it even shows up on auction or Discogs.  One of my most coveted Coxsone records. Incredible drumming on the dub.",
    "photo": "img/44.jpg",
    "year": "1977"
  },{
    "name": "So Much Love",
    "artist": "Alton Ellis",
    "description": "This should have been a hit, one of my favorite Alton tunes, originally written by Carole King. The 80s red and yellow label NYC pressing of this LP would be the logical choice for best pressing, but even that one is pretty subpar. I would just take whatever pressing you can get for cheap. Most pressings of this record stink, buyer beware, which is a shame as it compiles some really great songs Alton did for Coxsone.",
    "photo": "img/146.jpg",
    "year": "1967"
  },{
    "name": "Sitting In The Park",
    "artist": "Alton Ellis",
    "description": "This record was originally only on “Best of Alton Ellis”, an excellent  compilation.  Later on in the 80s and 90s Coxsone pressed it as a 45 single with a sweet version on the b-side. The 80s US pressing pictured here is by far the best way to DJ this song out.",
    "photo": "img/155.jpg",
    "year": "1969"
  },
  {
    "name": "Feel Good All Over",
    "artist": "Delroy Wilson",
    "description": "This 12” sounds really good.  It sounds like a very good US pressing but I’ve seen it listed as a UK release in numerous shops in Tokyo so I’ve never been able to confirm that. Most of the early 45 pressings sound OK even the blank, all play with small degrees of distortion and subtle background noise. All of these  pressings use the same FCD prefixed matrix number hence the similar quality. I’ve had a few copies of the OG UK pressing over they years, even the one in mint condition played  loud my wife said it sounded like nails on a chalkboard, it just doesn’t sound as warm and has a piercing quality.  It doesn’t really matter because there’s no reason to not play the 12” for me.",
    "photo": "img/11.jpg",
    "year": "1968"
  },
  {
    "name": "Respect",
    "artist": "Norma Fraser",
    "description": "For years I’ve wanted the UK Coxsone 45 but could never find it or afford it. So I’ve just played the tune off “Studio One Soul” which is pressed well and on thick vinyl. Soul Jazz then went above and beyond and repressed the tune on 45, which I now play out over the LP. The reissue 45 on Soul Jazz sounds fat and loud.",
    "photo": "img/135.jpg",
    "year": "1968"
  },
  {
    "name": "Never Let Go",
    "artist": "Slim Smith",
    "description": "Only way to hear the extended mix of one of the greatest Studio one songs by one of Jamaica’s great vocalists.  Plus, “Answer” is one of those riddims you just need in your box if you are playing sound system style. Loud pressing.",
    "photo": "img/26.jpg",
    "year": "1967"
  },
  {
    "name": "I’m Still In Love With You",
    "artist": "Alton Ellis",
    "description": "This is the original UK pressing which, like every 45 of this pressing, it sounds half decent.  There’s minimal press noise and at times minor distortion is present. Still playable out, but honestly the song sounds better on “Studio One Story”. You can tell even on that release the song was just not recorded that great. I owned and used to play out the original Jamaican pressing which sounds pretty similar to the UK pressing. UK is probably a little cleaner.",
    "photo": "img/94.jpg",
    "year": "1967"
  },
  {
    "name": "Too Experience",
    "artist": "Bob Andy",
    "description": "Laying the groundwork for Barrington Levy years beforehand, most of the 45 pressings of this sound good.  The UK pressing is very expensive and rare but plays with some rough patches.. The original Supreme pressing is the best I’ve heard, I also owned the blank at one point and it’s pretty similar to the Supreme, some minor pressing noise on both. I also for years played the 70s second press, has a tiny bit more hiss on that one but fine for playing out.",
    "photo": "img/171.jpg",
    "year": "1968"
  },
  {
    "name": "I’m Not A King",
    "artist": "Delroy Wilson",
    "description": "This is the original UK pressing on a blank. I normally like the Jamaican mixing and mastering over the UK’s but not in this case. Also The 70s Jamaican second press isn’t terrible I djed it for years, but has consistent low background noise. I always liked the Studio One version better than the later Striker Lee rendition.",
    "photo": "img/121.jpg",
    "year": "1967"
  },
    {
    "name": "Won't You Come Home",
    "artist": "Delroy Wilson",
    "description": "One of the songs I cherish most on the Studio One label. An unbelievable song that has soundtracked many events and times in my life. This late 70s/early 80s Studio One 12” sounds good and is solid for playing out. The Forward pressing is a bit lower quality, with a bit more noise, but comparable. The OG UK 45 pressing is what I used to DJ, some surface noise on that one, never looked back once I got the 12”. The yellow and red label NYC 45 pressing is good, but has slight noise, too. Plays cleanly off the top notch “Studio One Kings” compilation (Soul Jazz) with the hiss minimized via remastering",
    "photo": "img/43.jpg",
    "year": "1967"
  },
  {
    "name": "Your Love Is Amazing",
    "artist": "Dennis Brown",
    "description": "An overlooked classic Dennis Brown song.  Early evening crowd pleaser. This is the original 1972 pressing. It is semi-decent, the most you can ask for of a 70s Coxsone pressing, playable but some noise and crackles.",
    "photo": "img/177.jpg",
    "year": "1970"
  },
  {
    "name": "Consider Me",
    "artist": "Jennifer Lara",
    "description": "Always go US/NYC pressing when you can. This is no different for one of the top ranking Studio One female cuts of all time. A lot of Jennifer Lara’s output is too sweet or disco-esque for me but this a scorcher, house party tested many times. Also nicely pressed on “Studio One Women” via Soul Jazz.",
    "photo": "img/59.jpg",
    "year": "1980"
  },
  {
    "name": "Lend Me The Sixteen",
    "artist": "Johnny Osbourne",
    "description": "I slept on this tune until “Studio One Dancehall” came out. I have to give it to Stuart and the guys at Soul Jazz they really have put me up on some new shit over the years. This is the most desired among a handful of so-so 80s and 90s pressings.",
    "photo": "img/103.jpg",
    "year": "1978"
  },
  {
    "name": "River Jordan",
    "artist": "Bassies",
    "description": "Essential piece of roots music from Studio One. I’ve owned various copies of this over the years. The 70s Coxsone label pressing is pretty good. The original red label Jamaican pressing is loud but plays with noise as well. All the pressings of this tune, even this NYC pressing, play with some type of noise.  The UK pressing from ‘67 is in high demand, costing hundreds of dollars and background pressing noise is still present on that one.",
    "photo": "img/137.jpg",
    "year": "1967"
  },
  {
    "name": "When Will Be The End",
    "artist": "Ethiopian",
    "description": "A true piece of Studio One sufferers’ music. One of my top roots songs ever, pictured here is the original LP, NYC red and label pressing, which is the best. I can’t remember the last time I have played roots or Studio One without packing this LP in my crate.",
    "photo": "img/148.jpg",
    "year": "1980"
  },
  {
    "name": "Joy In The Morning",
    "artist": "Gaylads",
    "description": "This 12” version has been my secret weapon for years. Just a little bit of rockers style puts this mix over the top. When Soul Jazz put out the “Studio One Showcase” compilation they included this, the original 12” mix, the first repressing ever. The Soul Jazz pressing and the original 12” both sound good loud. The 45 pressing is the regular mix without the overdubs. I’ve had a few copies over the years of the 45 and they were all filled with surface noise, particularly the earlier WIRL pressings. The Dr. Bird pressing is a nice pressing of this tune on 45, which I would buy if I ever ran into it.",
    "photo": "img/19.jpg",
    "year": "1968"
  },
  {
    "name": "Swing Easy",
    "artist": "Soul Vendors",
    "description": "This is a very desired 45 in any pressing but a few pressings stand on top. This is a very good NYC pressing, the original UK pressing also sounds very good and loud, both have some minimal surface noise, probably present in the actual stampers. Skanking bordering on steppers. What a tune!  All time shit.",
    "photo": "img/161.jpg",
    "year": "1967"
  },
  {
    "name": "Happy Land",
    "artist": "Carlton And The Shoes",
    "description": "One of my top ten Studio One songs of all time! The blueprint to “Satta Massagana”, this is a clean pressing of this on the original red label Supreme. I own the black label Supreme which has a pressing defect and sounds like shit! Unplayable! The 2nd best pressing of this is the UK pressing, which doesn’t as usual sound as warm as the Jamaican copy but has less noise up front, more behind the music. Also you can play this off “Studio One Groups” via Soul Jazz Records which I have done many times.",
    "photo": "img/82.jpg",
    "year": "1968"
  },
  {
    "name": "Big Car",
    "artist": "Jackie Mittoo",
    "description": "Sweet version of William DeVaughn’s “Be Thankful For What You Got”, but even the tune repressed on “Studio One Scorcher Vol. 2” sounds hissy and not great. Makes it hard to version over due to overall low grade vibes. This is the original Jamaican pressing. Even the later US pressing  (on yellow colored vinyl) sounds the same not great. all pressings have issues.",
    "photo": "img/178.jpg",
    "year": "1970"
  },
  {
    "name": "Tell Me Where",
    "artist": "Jennifer Lara",
    "description": "Certified slayer, relicking an old Termites song, besting the original and then some. This is the 80s Rosette, red label Jamaican pressing. It’s solid. Some pressing noise, same for this red and yellow NYC pressing, which is my choice copy. “Tell Me Where” also appears on the compilation “Studio One Women” (Soul Jazz).",
    "photo": "img/163.jpg",
    "year": "1983"
  },
  {
    "name": "Set Me Free",
    "artist": "Ken Boothe",
    "description": "Great song but not a high quality pressing. It’s full of background hiss. Better for playing out on “Studio One Soul” (Soul Jazz). A Dance floor heater.",
    "photo": "img/34.jpg",
    "year": "1978"
  },
  {
    "name": "Gates Of Zion",
    "artist": "George Dudley",
    "description": "A serious staple of our DJ parties in Boston. What a tune! So trance like. So african. A masterpiece of roots music. Years later I found an almost mint pressing of this on 12” in a shop in Philadelphia! Needless to say I run that copy out now.",
    "photo": "img/12.jpg",
    "year": "1979"
  },
  {
    "name": "Bongo Red",
    "artist": "Gladiators",
    "description": "Original pressing. All the pressings of this 45 sound like shit. Play it off either of Heartbeat’s Gladiators compilations (“At Studio One”/ “Studio One Singles”), which sound much better than any of the Soul Jazz repressed material. For example “Bongo Red” on “Studio One Ironsides” sounds like it was pressed from the original vinyl. Soul Jazz’s pressing has the background hiss present on the original 45. Whereas Heartbeat’s release doesn’t.  Sounds like it was from the original master tapes and remastered.",
    "photo": "img/53.jpg",
    "year": "1974"
  },
  {
    "name": "The King Is Back",
    "artist": "King Rocky",
    "description": "This is the 2nd Jamaican pressing on Supreme.   The UK pressing is very expensive, over $500 when it even shows up on auction. The Jamaican pressing included here actually uses the same stamper as the UK pressing and has the same matrix number and is a lot more affordable. The original Jamaican pressing on Coxsone I owned at one point it uses the same stamper but has a bit more hiss. This makes sense as judging by the matrix number this Jamaican release uses the Uk stampers, which wasn’t that uncommon for Studio One. The Jamaican pressing is rough and ready. It plays with some crackles and noise but is loud and ready to murder someone. If someone plays this against you in a sound clash, pack up and go home.",
    "photo": "img/102.jpg",
    "year": "1968"
  },
  {
    "name": "All Rudies In Jail",
    "artist": "Mr. Foundation",
    "description": "One of the rarest Scully Simms cuts as his alias, Mr. Foundation. This is the UK pressing which took me almost a decade to find. The UK pressing is decent with minimal noise, same for the Jamaican pressing under the title “Jail House”. Reissued once over the years, by Rock A Shacka (Japan), but only on CD.",
    "photo": "img/48.jpg",
    "year": "1967"
  },
  {
    "name": "The First Cut Is The Deepest",
    "artist": "Norma Fraser",
    "description": "All 45 pressings of this tune are rough around the edges. I like this 1977 reissue, desired for cleanest press (which in this case means less hiss), and also has the dub. The original UK Coxsone from 1967 has pressing noise and pops. One of the best Studio One songs ever, always ready to party.",
    "photo": "img/73.jpg",
    "year": "1967"
  },
  {
    "name": "Pressure",
    "artist": "Jim Brown",
    "description": "An underrated smasher that’s only available on this 12” from the 80s. “Pressure”, as in the “Pressure and Slide” riddim, is a good pressing, clear and loud.",
    "photo": "img/30.jpg",
    "year": "1983"
  },
  {
    "name": "Pressure And Slide",
    "artist": "Hubert Lee",
    "description": "Most people know the Tenors version. I have always preferred Hubert Lee’s take from 1969, Never reissued or repressed.  Thankfully, this is a quality pressing.",
    "photo": "img/127.jpg",
    "year": "1978"
  },
  {
    "name": "Oh Mr DC",
    "artist": "Sugar Minott",
    "description": "An anthem of my crew and our sound system. This is the best 45 pressing. The song can also be found on Heartbeat’s “Best of Studio One” LP and Soul Jazz’s “Studio One Classics” LP. I have DJed this record consistently for over 10 years on 45.  It is indispensable.",
    "photo": "img/122.jpg",
    "year": "1978"
  },
  {
    "name": "Home, Home, Home",
    "artist": "Ken Boothe",
    "description": "A favorite of my family’s. This is the original UK Coxsone pressing which sounds good, with limited noise. I also have this on a 12”, which has an extended mix and is pressed OK at best.",
    "photo": "img/87.jpg",
    "year": "1967"
  },
  {
    "name": "Drum Song",
    "artist": "Soul Vendors",
    "description": "For many years I brought the 70s Coxsone repress of “Drum Song” to gigs, which was totally passable. I recently found a copy of the UK press and was disappointed. It plays loud but has constant background noise. The Jamaican pressing also plays loud but with less pressing noise. No perfect pressings of this on 45, but I’d take the original Jamaican pressing over the others. If I could find a clean Jamaican pre-release/blank I would buy it as it has the least amount of crackling.",
    "photo": "img/166.jpg",
    "year": "1967"
  },
  {
    "name": "Let’s Join Together",
    "artist": "Melodians",
    "description": "This UK pressing is a decent to good pressing. The Jamaican pressing on “Throw Down Your Weapon” is from the same stamper, both have bearable surface noise. Erroneously credited in the UK to the Gaylads, this is a different version than the more widespread Treasure Isle recording of the same track.",
    "photo": "img/105.jpg",
    "year": "1967"
  },
  {
    "name": "Express Yourself",
    "artist": "Leroy Sibbles",
    "description": "I was first exposed to this fantastic Studio One cover of Charles Wright’s funk anthem via Soul Jazz’s “Studio One Soul” compilation. Years later I found the original 45 pressing in a warehouse in Nassau county on Long Island. I DJed that original pressing for years. It was fine but has some background hiss. I upgraded to this Soul Jazz 45 repressing which is heavy duty and sounds cleaner.",
    "photo": "img/70.jpg",
    "year": "1970"
  },
  {
    "name": "Open The Gate",
    "artist": "Ethiopian",
    "description": "This one is very rare, nearly  impossible to find on 45, and took me years just to confirm it existed! This is a good 45 pressing from the 1970s and a total desert island Studio One selection. I played “Open The Gate” for years off Heartbeat’s “Best of Studio One Volume 2” LP before acquiring this 45 from Japan.",
    "photo": "img/124.jpg",
    "year": "1979"
  },
  {
    "name": "Give Me Back Mi Language And Me Culture",
    "artist": "Count Ossie Im",
    "description": "I’ve gone through a variety of pressings of what may be Dennis’s most timeless tune. Ironically, given how masterful his songwriting was, it’s a cover. This NYC pressing is good, but not great. The 12” has surface noise/hiss and I don’t suggest it. From my limited listening I assume the Banana UK pressing is an upgrade.",
    "photo": "img/79.jpg",
    "year": "1970"
  },
  {
    "name": "No Man Is An Island",
    "artist": "Dennis Brown",
    "description": "I’ve gone through a variety of pressings of what may be Dennis’s most timeless tune. Ironically, given how masterful his songwriting was, it’s a cover. This NYC pressing is good, but not great. The 12” has surface noise/hiss and I don’t suggest it. From my limited listening I assume the Banana UK pressing is an upgrade.",
    "photo": "img/118.jpg",
    "year": "1970"
  },
  {
    "name": "Soul And Inspiration",
    "artist": "Freddie McGregor",
    "description": "An “off the beaten path” Freddie track covering the Righteous Brothers’ hit song. All three pressing variations use the same stampers and are pretty similar.  The 12” plays pretty loud, but is average at best with persistent surface noise.",
    "photo": "img/36.jpg",
    "year": "1977"
  },
  {
    "name": "My Sweet Lord",
    "artist": "John Holt",
    "description": "My father was a Hare Krishna and loved John Holt, but he didn’t love this version because he moved a lot of George Harrison’s religious overtones out of the song, which is why I like it!  “My Sweet Lord” was only on a UK LP on the Melodic label for years, then thankfully added onto Heartbeat’s Holt compilation, “ I Can’t Get You Off My Mind”.  One of my go-to records when we have friends over and I want to play a full length. Heartbeat’s reissue material has really marinated over the years.",
    "photo": "img/17.jpg",
    "year": "1972"
  },
  {
    "name": "Back Out",
    "artist": "Wailing Souls",
    "description": "Later redone for Channel One, This is the original 70s Coxson pressing.  It’s not the greatest pressing, kind of soft and some hiss. Early Supreme pressings sound similar, a bit louder but pressing hiss is still evident. The Banana UK pressing is the best and cleanest . Every pressing of this song has background noise even on the LP so I have to assume it was an issue with the master tapes.",
    "photo": "img/51.jpg",
    "year": "1970"
  },
  {
    "name": "Jamaica",
    "artist": "Alton Ellis",
    "description": "The only excuse for this never being a single is how deep Alton’s catalog is! This track is reason alone to look for a good pressing of this classic “Best of” compilation. The silk screen cover doesn’t denote an early pressing. Coxsone must have had some left over covers and repressed records in the 80s with them.  You get the best of both worlds, the silk screen cover with the red and yellow label and the 80s NYC pressing. The original Jamaican pressing is also nice.",
    "photo": "img/145.jpg",
    "year": "1969"
  },
  {
    "name": "I’m Still Waiting",
    "artist": "The Wailers",
    "description": "I love that this is barely a reggae record, it’s almost just a soul record. I love when the Wailers are on that tip.  This is a 70s second pressing, a pretty good copy. The  earlier red and white label press is also similarly good.",
    "photo": "img/99.jpg",
    "year": "1965"
  },
  {
    "name": "Sinner Man",
    "artist": "The Wailers",
    "description": "Flipping the Nina Simone in classic style. I have gone through so many pressings of this and they all sound like shit. All have surface hiss that make it impossible to DJ or even listen to them. Years later I have settled for playing the record off Heartbeat’s compilation, “Climb The Ladder”. Luckily “Sinnerman” plays first on the b-side to that record as the record is stuffed with tracks. The pressing is at least noise-free and needs to be boosted since it’s from an LP.",
    "photo": "img/147.jpg",
    "year": "1966"
  },
  {
    "name": "Dancing Mood",
    "artist": "Delroy Wilson",
    "description": "Years ago, I played an old friend of mine’s wedding in Los Angeles and she requested this song so I took a few months trying to find a prime pressing.  I went through a variety of 1960s Jamaican pressings that use the original mix, easily identified by the inclusion of “More and More Amour” on the b-side. Most are hard to find in good condition. Island UK pressing is the most accessible, but I was never crazy about the way it sounded. The later 1960s and 1970s pressings include a slightly different take of “Dancing Mood” and the dub on the b-side. I actually prefer the later take which is included here, more of a rocksteady vibe on this version. This is the first pressing of that take from 1968.",
    "photo": "img/61.jpg",
    "year": "1968"
  },
  {
    "name": "How Strong",
    "artist": "Ken Parker",
    "description": "The prototypical Studio One slow burner covering O.V. Wright’s “That’s How Strong My Love Is”, a song Otis Redding went on to make famous. I’ve never been much of a Ken Parker fan but this is a fantastic rendition. This UK pressing is on the low end compared to a lot of the Coxsone UK pressings. There is an extremely rare Jamaican pressing, which also has noise throughout.",
    "photo": "img/92.jpg",
    "year": "1967"
  },
  {
    "name": "Willow Tree",
    "artist": "Alton Ellis",
    "description": "This is the sole pressing of this tune on 45. Very obscure, it’s not even listed on Discogs!  Also  available on the LP Mr. Dodd compiled, “Best Of Alton Ellis”. As usual, the red and yellow label US pressing is choice.",
    "photo": "img/176.jpg",
    "year": "1977"
  },
  {
    "name": "Power Version",
    "artist": "Dennis Alcapone",
    "description": "This original Coxsone is similar to most original pressings, plays loud but with minimal surface noise and intermittent crackling. This is one of my favorite DJ cuts from Studio One of all time, Dennis Alcapone’s greatest song.",
    "photo": "img/20.jpg",
    "year": "1972"
  },
  {
    "name": "Africa",
    "artist": "Gaylads",
    "description": "Great reissue by Soul Jazz, a very nice quality pressing. Much needed, as this song was hard to source on 45. The original UK pressing is at least a 500 dollar record,  It is a clean pressing with minor background noise. I spent many years scouring record stores in the 5 boroughs and online for a copy of this song on the always desirable red and yellow label US press, but never had any luck.",
    "photo": "img/45.jpg",
    "year": "1967"
  },
  {
    "name": "I Don’t Want To See You Cry",
    "artist": "Ken Boothe",
    "description": "I don’t get why people pay so much money for the UK pressing of this tune on the Bra label. It sounds like crap. I have a copy and I never could integrate it into a set.  The UK Island pressing isn’t much better. It plays loud, but has pressing noise like all copies of this song. It’s just a matter of how much. Even the 60s Jamaican pressings (green and red label versions), with the Wailers cut on the flipside, have surface hiss. My copy on this second generation Studio One is playable but definitely has some hiss in the background.",
    "photo": "img/63.jpg",
    "year": "1966"
  },
  {
    "name": "I’m Gonna Take Over Now",
    "artist": "Ethiopians",
    "description": "Over the years I’ve DJed this copy, the Jamaican original pressings, and  a later 80s or 90s Rosette pressing, neither is great but really there is no good pressings of this song. They are all pressed from the same stamper so the older and closer to the original date of the stamper creation the better. Every 45 pressing of this song has surface noise. This tune is just so clash ready and battle tested for me over the years I play it anyway.",
    "photo": "img/93.jpg",
    "year": "1966"
  },
  {
    "name": "Groove Me",
    "artist": "Leroy Sibbles",
    "description": "If it wasn’t for Soul Jazz, not many people would know this song.  They included it on the absolutely crucial “Studio One Soul” compilation. “Groove Me” is a  true dance party starter. This is a good pressing Soul Jazz also put out on 45. This single was pressed in the 70s and oddly was not pressed again. The 70s pressing isn’t the greatest with steady background noise throughout and usually sells for over a 100  bucks.",
    "photo": "img/81.jpg",
    "year": "1970"
  },
  {
    "name": "Easy Snapping",
    "artist": "Theo Beckford",
    "description": "Originally pressed on Worldisc before Coxsone started Studio One, “Easy Snapping” is an early Coxsone burner right here, warm up business for sure. This is a later 70s pressing that sounds good that I got from an old spot in Hartford that used to get heat and was off a lot of people’s radar. The original pressing has more background hiss.",
    "photo": "img/69.jpg",
    "year": "1959"
  },
  {
    "name": "Jail House",
    "artist": "The Wailers",
    "description": "I have the Studio One original pressing from the early 70s or late 60s which is good but does have slight surface noise. Still, it’s wanted by many. I recently bought the Bamboo UK pressing, thinking it would be an upgrade. It was not! The Jamaican pressing is louder and sounds warmer. The Supreme pressing also plays very well and is on thick vinyl. Ultimately the Supreme pressing and the various Studio One pressings from this time period - yellow/black (shown here), red/white, and white/black all play similar as they are from the stampers and have the same matrix number. The song was originally released on a Muzik City blank and various pressings in 1966 as “Good Good Rudie “ which play similar also.",
    "photo": "img/101.jpg",
    "year": "1966"
  },
  {
    "name": "Rasta Shook Them Up",
    "artist": "The Wailers",
    "description": "The Dub Store reissue was a revelation as all the previous pressings left something to be desired. The UK pressing, on Dr. Bird, sucked.   I would DJ out the original Coxsone but it has a hiss, as do most pressings. Hard to argue with an affordable high quality Japanese reissue of this caliber.",
    "photo": "img/132.jpg",
    "year": "1966"
  },
  {
    "name": "Come Forward",
    "artist": "The Silvertones",
    "description": "Stuart and company enlightened me with this tune on their “Studio One Disco Mix” compilation (Soul Jazz).  Versioning Ken Boothe’s “Come Running Back”, both late 70s pressings of this sound good and are from the same stamper.",
    "photo": "img/118.jpg",
    "year": "1981"
  },
  {
    "name": "Message From A Black Man",
    "artist": "The Heptones",
    "description": "This is the original pressing from 1969. I can, and have, played this out at parties and it works, but it’s a bit rough around the edges.  The Bamboo UK pressing has more surface hiss, but it doesn’t overpower the music. Compiled on the classic Soul Jazz release, “Studio One Soul”.",
    "photo": "img/112.jpg",
    "year": "1969"
  },
  {
    "name": "Treat Me Good",
    "artist": "Peter Tosh And The Wailers",
    "description": "This tune was mistakenly credited to the “Bop and The Beltones”, also the original UK Coxsone blue label press credits the song to his former alias,“Peter Touch”. My preferred version is this 70s repress using UK stampers so it is rather similar to the original UK copy. The recording of this song isn’t great so you’re not going to find a particularly hi-fi copy.  Jamaican pressings on red, green, and even black text labels from 1967 will all have pressing noise but are worth sourcing based on how good this song is. Be warned they don’t show up often. The jamaican pre release blank on Coxsone is the best I’ve heard but I have only seen one copy for sale over the years.",
    "photo": "img/172.jpg",
    "year": "1967"
  },
  {
    "name": "I Hold The Handle",
    "artist": "The Heptones",
    "description": "I once read that Sugar Minott said sound systems in Jamaica used to play the entire record from front to back and people would ask them to pull up the whole LP! This is one of the pillars of Studio One and one of the greatest Jamaican records ever! The Coxsone UK pressing, with the alternate cover, is very expensive. People will pay $500 for it, which I never really understood as the record doesn’t sound great and has background noise. I own an original Jamaican copy that I don’t play often, even at home, as the NYC red and yellow 80s label pressing sounds so much better.",
    "photo": "img/21.jpg",
    "year": "1968"
  },
  {
    "name": "Imperial I",
    "artist": "Peince Jazzbo",
    "description": "Famed cut over Burning Spear’s “Door Peeper”, this took me a long long time to find on 45. I played it for years off of a copy on the “Choice of Version” LP, which leaves a lot to be desired as far as quality. That Jazzbo album was reissued in the 90s way after the fact. The 45 plays clean. There is also a yellow label pressing on Bongo Man that is pretty much identical.",
    "photo": "img/98.jpg",
    "year": "1972"
  },
  {
    "name": "Rastaman Camp",
    "artist": "Freddie McGregor",
    "description": "Originally I had a 1970s pressing with the red label, but it has fogging in the press and doesn’t sound good at all. The 2000s pressing is unexpectedly as the highly desirable Winro original pressing, which I think has more distortion and press noise than the latter. Don’t get me wrong, neither is great. But the song is! I have DJed the 2000s pressing for years, but mostly at roots parties in the daytime since the tune is pretty slow.",
    "photo": "img/131.jpg",
    "year": "1976"
  },
  {
    "name": "Having A Party",
    "artist": "Dudley Sibley",
    "description": "Sam Cooke’s original cut of this is a party tune. So is this cut, which stays close to the original. Of all the most recent represses from the old Jamaican stampers, this is one of the better. In most cases, the less popular the song, the better the stampers sound after all these years . Basically, because less records were pressed off it, so there’s less wear and tear. Coxsone was not quick to replace his stampers, and would milk them to all hell. I compared the original UK Banana pressing, which ended up being pretty similar but with more distortion. I also have a white label original pressing of this and it has similar pressing noise to the repress.",
    "photo": "img/83.jpg",
    "year": "1970"
  },
  {
    "name": "One Love",
    "artist": "The Wailers",
    "description": "I used to play a copy of this tune from Heartbeat’s excellent Wailers 7” singles box. As Ernie B said, it’s “one for the ages”. But I scratched the shit out of it one night at a crazy house party and now it skips. This song is recorded pretty rough so any pressing isn’t going to be amazing, but later US pressings (45 and LP) are clean.  The 70s and 80s pressings have overdubs with different mixes I don’t care for as much but they do help make the song passable over a loud sound system. I have also played out the blue Coxsone pressing which is a second 70s pressing and is in high demand.  It plays loud with infrequent minimal surface noise/background hiss.  The original 1965 pressing (not the greatest time period for Jamaican vinyl quality overall) has minor surface noise and is very desired/expensive.",
    "photo": "img/123.jpg",
    "year": "1965"
  },
  {
    "name": "Door Peeper",
    "artist": "Burning Spear",
    "description": "This tune launched one of the most enigmatic voices of our time, the Burning Spear. For years I assumed the Bamboo UK pressing is the best way to go if you’re serious about playing this song loud. That wasn’t the case though the Bamboo did play cleaner than the Jamaica original pressings but it sounded flat and kind of slightly distorted. Old Jamaican pressings aren’t bad but have slight hiss as you’d expect but much more playable over a loud sound system than other Burning Spear singles of the time. This Coxsone pressing and the original Supreme pressing both use the same stamper but the earlier Supreme pressing is pressed slightly louder on thicker vinyl.",
    "photo": "img/67.jpg",
    "year": "1969"
  },
  {
    "name": "Jah Light",
    "artist": "Judah Eskender Tafari",
    "description": "Studio One heads know “Pirate’s Choice” is one of the best compilations of Studio One material ever, released after Coxsone’s hand was forced in response to a Canadian bootleg release. Oddly this version that Coxsone pressed has never appeared elsewhere. The 45 pressing has a different rockers sound to the riddim. This is one of best Studio One roots records on the preferred original US pressing.",
    "photo": "img/29.jpg",
    "year": "1978"
  },
  {
    "name": "Rockfort Rock",
    "artist": "Sound Dimension",
    "description": "This is actually the second pressing. The original pressing was titled “Psychedelic Rock” and has a slightly different mix. That mix can be found on a red and white UK Studio One pressing, a Jamaican issue on Coxsone, and blanks turn up once a decade. From my limited experience hearing them over the years, they all play pretty good, more a matter of what you can find than anything else. The UK pressing is at the top of the heap. The most cost affordable way to play this out would be on Heartbeat’s excellent compilation “Downbeat The Ruler”.",
    "photo": "img/138.jpg",
    "year": "1972"
  },
  {
    "name": "Simmer Down",
    "artist": "The Wailers",
    "description": "“Simmer Down” was a smash hit reportedly selling over 80,000 copies. This Coxsone pressing from the 60s on various colored vinyl is the most expensive and desired, which plays loud but with some crackle and surface noise. The original UK pressing on Ska beat is comparable but the Jamaican pressing is warmer sounding to me.  The 70s Coxsone pressing is very good quality compared to most pressings of this era by Mr. Dodd.  Only very slight surface noise is present. Reportedly pressed from the master tapes on Heartbeat’s “Studio One Singles” 7” box set, it’s now out of print and over $100. I kick myself for not getting it when it was $34.95, but I was broke then and barely had money for a burrito.",
    "photo": "img/143.jpg",
    "year": "1964"
  },
  {
    "name": "Unchained",
    "artist": "Bob Andy",
    "description": "I love this 12” mix. The horns work for me and this is always a smasher at any roots man party. This pressing plays loud and heavy but is unofficial. I believe it’s an Italian bootleg, some copies have a bootleg Winro label, others like this, just a white label.  If you would prefer the song without the horns mix you can find a decent 70s pressing of the regular mix on the back-side of the Wailers’ “Let Him Go” 45, pops and crackles are present. You can also play the song cleanly off Andy’s classic album “Bob Andy’s Songbook”. Go for the red and yellow 80s NYC pressing. I used to own the red label original Coxsone pressing of that LP from 1972 and it is warm and loud but has more pressing noise than the NY pressing, which is superior.",
    "photo": "img/41.jpg",
    "year": "1969"
  },
  {
    "name": "Tenement Yard",
    "artist": "Eddie Constantine",
    "description": "The 45 pressing of this isn’t great, but it is certainly better than the 12” pressing which doesn’t sound good at all and still trades for big money. Honestly both pressings suck, my friend recorded a mint condition vinyl copy of the 12 and remastered it for me and gave me an acetate which is pictured here. A truly rare devastating piece of 80s sufferers from Coxsone. All time crusher. Why has Soul Jazz not reissued this? This would have been a crucial inclusion on their “Studio One Dancehall” compilation. Prime late era Studio One, I blew the speakers out playing this loud in Honolulu at Downbeat Diner.",
    "photo": "img/missing.jpg",
    "year": "1986"
  },
  {
    "name": "Ethiopians Live It Out",
    "artist": "Burning Spear",
    "description": "I have purchased every pressing of this song on 45 over the years and they all suck with a serious background hiss. Heartbeat did a pretty good job to remaster and reduce the hiss on their Burning Spear compilation, but it’s still present, as did Soul Jazz.",
    "photo": "img/missing.jpg",
    "year": "1971"
  },
  {
    "name": "Can’t Get You Off My Mind",
    "artist": "John Holt",
    "description": "This tune was never a single although it should have been! What a tune this is!  It is best played off Heartbeat’s John Holt compilation. John Holt is one of the greatest singers of all time, up there with Otis Redding and Sam Cooke. His songwriting is nothing short of amazing.",
    "photo": "img/16.jpg",
    "year": "1971"
  },
  {
    "name": "African Descendents",
    "artist": "Alton Ellis",
    "description": "One of the hardest Studio One roots tunes ever. Alton is the greatest Jamaican singer of all time and he wasn’t afraid to throw down some super hard militant vibes. Case in point is this monster. This is an early to mid-80's US repressing of the 1971 original. I DJed the original Jamaican pressing at one point. It sounds alright, but not as loud as this US repressing. Every 45 pressing of this has background noise.",
    "photo": "img/47.jpg",
    "year": "1973"
  },
  {
    "name": "Frozen Soul",
    "artist": "Soul Vendors",
    "description": "Another tune I got from my friend, Ernie, at Ernie B. Ernie knows what sounds good on a loud sound system and he doesn’t disappoint, this record sounds good.  This is a nice 2nd pressing, and is the original mix. The later 1970s presses contain this cut in less desireable rockers style mix . The UK pressing on 45 also includes this original mix and plays without much surface noise or background hiss.",
    "photo": "img/75.jpg",
    "year": "1969"
  },
  {
    "name": "I Don’t Know Why",
    "artist": "Delroy Wilson",
    "description": "This 70s Coxson pressing I acquired from an old record haunt in Miami. Pressing hiss is present on this version and most previous or subsequent 45s. The blank is the most coveted of all pressings but still has hiss. Plays clean off “Studio One Lovers” (Soul Jazz).",
    "photo": "img/64.jpg",
    "year": "1971"
  },
  {
    "name": "Time Is Tight",
    "artist": "Sound Dimension",
    "description": "A reworking of the Booker T and the M.G.’s hit of the same namesake, this 70s second pressing is the best option in my opinion.  I’ve never cared for the original UK pressing. I’ve had two copies over the years and they both had annoying surface noise. The recent UK pressing via Soul Jazz on the other hand is comparable to the Jamaican pressing. The pressing shown here sounds warm but has more pressing noise. And while the Soul Jazz pressing sounds clean and loud, it sounds digitally remastered.",
    "photo": "img/170.jpg",
    "year": "1969"
  },
  {
    "name": "Easy Take It Easy",
    "artist": "Dennis Brown",
    "description": "A reworking of the Booker T and the M.G.’s hit of the same namesake, this 70s second pressing is the best option in my opinion.  I’ve never cared for the original UK pressing. I’ve had two copies over the years and they both had annoying surface noise. The recent UK pressing via Soul Jazz on the other hand is comparable to the Jamaican pressing. The pressing shown here sounds warm but has more pressing noise. And while the Soul Jazz pressing sounds clean and loud, it sounds digitally remastered.",
    "photo": "img/68.jpg",
    "year": "1969"
  },
  {
    "name": "Jah Jah Way",
    "artist": "Jackie Bernard",
    "description": "My mother’s favorite roots song of all time, this is a staple of our household. An extremely rare 45, it can be found on the bootleg “Studio One Classics Roots” compilation, which has a great track listing, but doesn’t have the best sound quality. That LP is a serious pocket saver/crate saver nonetheless.  Soul Jazz probably recorded directly from the original record as well on “Studio One Roots 2”, but they did a nice job of cleaning up the hiss and audio quality.",
    "photo": "img/100.jpg",
    "year": "1972"
  },
  {
    "name": "Declaration Of Rights",
    "artist": "The Abyssinians",
    "description": "I have gone through a few half ass 45 pressings of this tune over the years. I prayed for years I would find an original copy using a different stamper, hoping for better quality. It wasn’t.  I never expected this second press to sound so good. The bass on this just knocks! I found this from a seller in Toronto. I have also played this off  the “Studio One Story” LP on Soul Jazz and the Soul Jazz UK 45 pressing where it sounds loud and clear. Roger that.",
    "photo": "img/62.jpg",
    "year": "1970"
  },
  {
    "name": "I Don’t Want To Be Right (Version)",
    "artist": "Alton And The Ili Sticks",
    "description": "A very rare 45 find, years ago I bought a beat copy  from Carter Van Pelt. Since then I had been looking to upgrade mainly because the dub on this is very good and unavailable anywhere else. I finally found a cleaner copy at one of the finer outlets for old Jamaican 45s on the planet, Coco Isle in Tokyo. I also found a copy in Turkey of all places but it was about the same condition, VG. The vocal cut can also be heard on “Studio One Soul” via Soul Jazz Records.",
    "photo": "img/66.jpg",
    "year": "1972"
  },
  {
    "name": "Creation Rebel",
    "artist": "Burning Spear",
    "description": "Some of the Burning Spear 70s Forward pressings are just ghastly. This is a bit better than that, but not much. There is lots of pressing hiss on this 45, probably best listened to and played out on either Heartbeat or Soul Jazz’s Burning Spear retrospectives, although these remastered LPs just minimize the hiss not eliminate it.",
    "photo": "img/60.jpg",
    "year": "1975"
  },
  {
    "name": "Sing Jah Style",
    "artist": "Johnny Osbourne",
    "description": "Unbelievable cut by Mr. Osbourne in the wake of the riddim revival going on at Studio One in the late ‘70s.  It’s best played off either the original US Pressing or “Studio One Classics” on Soul Jazz. The “Truth and Rights” LP as a whole is Johnny Osbourne’s master work and is easily one of the best full length records Coxsone released.",
    "photo": "img/149.jpg",
    "year": "1979"
  },
  {
    "name": "My Conversation",
    "artist": "Cornell Campbell",
    "description": "I got this from Human Head records in NYC. This is a good US 12 “ pressing and a rare opportunity to get a Studio One lick of the foundation riddim, “My Conversation”. A must have for any self respecting sound man for the riddim alone.",
    "photo": "img/5.jpg",
    "year": "1979"
  },
  {
    "name": "Full Up",
    "artist": "Sound Dimension",
    "description": "One of the most versioned rhythms of all time. This is a 1972 era pressing from the original stamper. All pressings play loud but have a bit of crackle and noise. I also have a copy of the first pressing of “Full Up” with a Cecile Campbell tune on the flipside that uses this same original stamper and it doesn’t sound as good but is somewhat similar, slightly more noise on that pressing. The later second 70s pressing with the version on the b-side don’t play as cleanly.",
    "photo": "img/76.jpg",
    "year": "1969"
  },
  {
    "name": "Never Give Your Heart Away",
    "artist": "Carlton And The Shoes",
    "description": "This is the 7” album mix. It’s a bit mellower and doesn’t have overdubs like the more commonly heard 12” mix. More people have heard the 12” mix because Soul Jazz reissued it on “Studio One Lovers”. Most people won’t notice the difference, but I prefer this original mix. Pretty decent pressing. Very rare in good condition.",
    "photo": "img/116.jpg",
    "year": "1977"
  },
  {
    "name": "Get In The Groove",
    "artist": "Heptones",
    "description": "This is the original Coxsone 45. Most pressings of this are good quality. The rosette 70s/80s red writing, white label press is good to play out. The red and yellow NYC label press is fine, too.",
    "photo": "img/77.jpg",
    "year": "1970"
  },
  {
    "name": "Shelly Belly",
    "artist": "Roland Alphonso",
    "description": "As usual the original UK pressing on Banana plays louder and with less surface noise than any of its Jamaican counterparts. The Jamaican release  with half blue label is a bit scrappier but I DJed it for years before I got the Banana pressing from London.  An underrated cut on the “Love Me Girl” riddim.",
    "photo": "img/142.jpg",
    "year": "1971"
  },
  {
    "name": "What Kind Of World",
    "artist": "The Cables",
    "description": "The UK blue label pressing from 1968 is the most expensive and desired pressing. For many years I DJed the second most desirable pressing, what I believe to be a US pressing based on the label art.  The Jamaican pressings with the Half color half white label are good sounding but have surface noise and crackles. Over the years I’ve realized there is no perfect pressing of this, most play good at best, they all have surface noise, crackles, and shit. I finally settled after many copies for this original Jamaican blank that uses the same stamper as the previous mentioned half color half white 60s pressings, it is the best I’ve heard which I include here.",
    "photo": "img/175.jpg",
    "year": "1968"
  },
  {
    "name": "You Don't Love Me",
    "artist": "The Cables",
    "description": "Later remade to massive international acclaim, this is the original version. Finally a 45 pressing of this that is semi clean and obtainable! Nice work by Soul Jazz. Coxsone 70s presses are what you’d expect; loud, tiny bit of distortion, varying levels of press noise and crackles, etc. The original UK pressing (only on a blank) was my most desired pressing for a long time, but I eventually realized that pressing also has background hiss. It sounds to me like the Soul Jazz reissue uses the UK blank pressing mentioned here as the source, possibly recorded straight from record. The hiss is sitll present on the Soul Jazz remastering but it’s certainly a bit better. The background hiss also shows up on Heartbeat’s reissue compilation “Feel Like Jumping” so perhaps it is present on the master tapes themselves. Regardless this will get people up and going for sure!",
    "photo": "img/119.jpg",
    "year": "1967"
  },
  {
    "name": "Let Me Get To Know You",
    "artist": "Otis Gayle",
    "description": "Possibly the deepest rare Studio One tune I own and one my favorite Studio One songs of all time. Too bad there is only bad Money Disc pressings of it. Soul Jazz needs to reissue this tune!",
    "photo": "img/104.jpg",
    "year": "1973"
  },
  {
    "name": "Chase Them Crazy",
    "artist": "Lone Ranger",
    "description": "Very rare and obscure Coxsone DJ production. Lone Ranger and Welton Irie, sparring and  toasting all over the Mr. Bassie riddim. This tune has never repressed or compiled I’m not sure why. A secret weapon of mine over the years.  It is only available on this OG Jamaican 45 which routinely sells for good money. A Tough and under rated tune on a solid pressing.",
    "photo": "img/56.jpg",
    "year": "1977"
  },
  {
    "name": "Ten To One",
    "artist": "The Mad Lads",
    "description": "I have owned at least 5 different pressings of this 45, from the original 70s Coxsone/Coxson pressings to the later 90s repressings. All of them are loud but have crackles and imperfections. Even the go to NYC red and yellow label isn’t great. The best way to play this cleanly over a loud sound system is to play it off “Studio One Lovers” (Soul Jazz).",
    "photo": "img/164.jpg",
    "year": "1971"
  },
  {
    "name": "Choice Of Colour",
    "artist": "Heptones",
    "description": "This is a 70s repressing. I actually prefer this second pressing to the original pressing with the half red/pink label. The original pressing is noiser, doesn’t sound as good loud, and is really hard to find.The Heptones recorded many incredible reindtions of american soul standards over the years but this is at the top of the heap. An unreal version that rivals the Motown original.",
    "photo": "img/57.jpg",
    "year": "1970"
  },
  {
    "name": "Rearrange",
    "artist": "The Gladiators",
    "description": "This is the original 1976 pressing. Both 1976 pressings are OK but are somewhat noisy. The best way to play this is off one of the Gladiators compilations on Heartbeat which unfortunately are both out of print and hard to find.",
    "photo": "img/134.jpg",
    "year": "1976"
  },
  {
    "name": "Stars",
    "artist": "The Eternals",
    "description": "Cornell Campbell is one of Jamaica’s greatest vocalists of all time, and this is one of his greatest performances. I took me almost 12 years to find a copy of this on Supreme, a  loud late 60s, early 70s second pressing. For years before that I DJed the Jamaican pressing, I played out the black and white label, which is not as good. It has plenty of surface noise and crackles.. Appears in nice quality on “Studio One Rocksteady” (Soul Jazz).",
    "photo": "img/157.jpg",
    "year": "1969"
  },
  {
    "name": "Afrikaan Beat",
    "artist": "Lester Sterling",
    "description": "For about a decade the only pressing I was ever been able to acquire of “Afrikaan Beat”, the rhythm source for Barrington Levy’s massive 90s hit “Under Me Sensi” was a red and white 90s pressing. It was surprisingly decent. The 1960s UK pressing was a holy grail of mine for years and I was ecstatic to finally find a copy to DJ.. I have lost quite a few auctions for that one over the years. I stumbled upon an even better pressing from a guy I buy records from in Europe. The b-side of Larry Marshall’s “Thelma” on the black and white Studio One 70s label pressing has this song credited to Sound Dimension and alternatively titled “African Chant”,and it sounds good loud! It is now my choice copy. Also appears on Soul Jazz’s “Studio One Scorcher” compilation.",
    "photo": "img/46.jpg",
    "year": "1968"
  },
  {
    "name": "Baby Why",
    "artist": "The Cables",
    "description": "This 45 mix is the album version. The first pressing I had of this and Djed was the OG 60s UK version, a loud mostly clean pressing that I still continue to play years later.  In the past decade I’ve acquired a variety of the original Jamaican pressings of “Baby Why” which do have some crackling on top of the music but sound warmer as usual than the UK counterpart. Every 60s pressing has the same issues so it must be an issue with the original stampers. I despise the 12 inch version of “Baby Why, a remix with cheesy synths, avoid that one at all costs. I have also DJed this song off Heartbeat’s “Best of Studio One” collection where it plays great.",
    "photo": "img/50.jpg",
    "year": "1968"
  },
  {
    "name": "Love Me Forever",
    "artist": "Carlton And The Shoes",
    "description": "So many pressings of this yet so few are quality. I’ve gone through a lot of them over the years, I played the 70s second pressing on Coxsone for years, which isn’t terrible but isn’t great.  This  Supreme pressing is very good, although the b-side (“Happy Land”) has a pressing defect and is fucked. For years I pursued the yellow and red NYC pressing and was disappointed to find out it had plenty of pressing noise and the version didn’t sound great. The 2017 UK repressing by Soul Jazz plays loud and fine and is a cheap easy way to get this on 45.",
    "photo": "img/108.jpg",
    "year": "1968"
  },
  {
    "name": "He'll Have To Go",
    "artist": "Roy And Enid",
    "description": "Textbook sweet rocksteady, one of my choice Studio One songs of all time. Beyond Ill. I must have Djed this song for 10 years before I realized it was a cover of an old country song. This is the UK pressing its decent, there is also a scarcely seen Jamaican blank with a different b-side (Enforcer - “Forgive Me”) which sounds good with minimal crackling and surface noise.",
    "photo": "img/85.jpg",
    "year": "1968"
  },
  {
    "name": "Change Your Ways",
    "artist": "Sugar Minott",
    "description": "What a tune! Talk about unheralded. This is the best Sugar Minott tune at Studio One besides “Oh Mr. DC” and no one ever plays it! I have played this for years off the “Live Loving” LP. The green cover with the red and yellow label has overdubs. The original Jamaican pressing with the black cover is not perfect, but plays in true stereo with some crackles and shit, but a good deep groove pressing overall. I have DJed both many times, they both work, although I prefer the sparser mix on the black cover pressing..  The UK pressing from 1978 is not suggested, the vocals do not pop like the Jamaican pressing. Once Soul Jazz put out the Sugar Minott retrospective I started Djing “Change Your Ways” off that compilation as it sounds great and has the least pressing noise.",
    "photo": "img/37.jpg",
    "year": "1977"
  },
  {
    "name": "Have You Ever Been In Love ",
    "artist": "John Holt",
    "description": "The 12” mix is a pretty rough pressing compared to a lot of the Studio One 12 inches,  which can be among the most high fidelity records Coxsone Dodd ever made. This is an average pressing at best with surface noise and imperfections but a great extended mix. If you want the tune on 45, the Jamaican original pressing (black text/white label with right text only) is solid. The Muzik City blank sounds good, too. I bought the 70s era 7” because it had the version on it, but it plays soft with hiss and I don’t suggest it.",
    "photo": "img/14.jpg",
    "year": "1974"
  },
  {
    "name": "Don't Wait For Me",
    "artist": "Albert Tomlinson",
    "description": "The original UK pressing on Giant is very expensive, sounds distorted and has subtle hiss. Barf. Oddly the “garbage dump” era 90s black and white studio one pressing sounds better but “Studio One Lovers” (Soul Jazz) is the best way to play this record out.  A Top rocksteady song. Deadly Dragon in NYC favors this song, that’s where I first got into it years ago.",
    "photo": "img/65.jpg",
    "year": "1968"
  },
  {
    "name": "How Could You Leave",
    "artist": "Freddie McGregor",
    "description": "Covering the classic Heptones song in fine style. A single only song that flew under a lot of people’s radars for years. I DJed this for about 7 or 8 years and no one ever knew this version until Soul Jazz anthologized it on their compilation “Studio One Rub A Dub”. This 45 pressing from the 1980s is the only pressing, and it plays loud with only minor background noise.",
    "photo": "img/91.jpg",
    "year": "1978"
  },
  {
    "name": "Have Mercy Mr Percy",
    "artist": "Termites",
    "description": "Holy hell this song is fire. . One of the top sufferers songs from Brentford Road ever. This is a pretty decent original UK pressing, I’ve never heard a good condition Jamaican copy on Lynn’s so I can’t compare them. I’ve owned a few copies over the years that were so thrashed it’s hard to evaluate them. Very hard to find at this point and expensive.",
    "photo": "img/111.jpg",
    "year": "1967"
  },
  {
    "name": "Skylarking",
    "artist": "Horace Andy",
    "description": "This is the original 45 pressing and it’s loud.  there’s  some rough patches present for sure, but it’s a good DJ copy. Soul Jazz recently reissued “Skylarking” on 45 and it sounds very clean which is an easier, cheaper alternative. Soul Jazz put the Dub Specialist mix on the b-side which is a bit spacier and riper for versioning. This original pressing has the “Underground Vegetable” version on the b-side which has more vocal bits interspersed.",
    "photo": "img/156.jpg",
    "year": "1972"
  },
  {
    "name": "Hello Carol",
    "artist": "The Gladiators",
    "description": "Some serious gutbucket sufferers right here. This Supreme Jamaican pressing is at the top of the heap among the many pressings of this song.  The UK pressing is also very desireable but head to head doesn’t sound as loud or warm as the Supreme pressing. A friend of mine randomly got me a copy of this in Italy on a mint condition Muzik City blank and it doesn’t play as good as the Supreme, or even my other 70s Studio One label copy.",
    "photo": "img/86.jpg",
    "year": "1969"
  },
  {
    "name": "Freak Out",
    "artist": "Jackie Mittoo",
    "description": "This is the original Coxsone 70s pressing. An ill cut on the “College Rock” riddim by the keyboard king himself. All pressings of this have some level of slight surface noise, although this is the best I’ve heard. One of the bedrocks of dancehall and foundation riddims, this song can be played cleanly off either Soul Jazz’s “Studio One Story” or Heartbeat’s “Downbeat The Ruler” compilations as well.",
    "photo": "img/74.jpg",
    "year": "1970"
  },
  {
    "name": "Empty Belly",
    "artist": "Ethiopian",
    "description": "This red and yellow label pressing is the best choice for this classic album. There’s been a lot of hard tunes over the years on the “Hot Milk” riddim but this may be the hardest. Sufferers music of the highest degree by the Ethiopian, Leonard Dillon.",
    "photo": "img/153.jpg",
    "year": "1980"
  },
  {
    "name": "I'm Just A Guy",
    "artist": "Alton Ellis",
    "description": "Coxsone sometimes used the UK stampers he made in Jamaica, and apparently something went wrong in the transfer process in this case and that accounted for the early Jamaican pressings playing with significant pressing noise. The original UK pressing itself plays with some background noise as do all pressings of this song on 45. The UK pressing isn’t terrible but plays a bit low and has noise. This 80s NYC pressing (which has overdubs unlike the OG UK pressing) isn’t going to win over any audiophiles but is the best pressing to play this out over a loud system. I have also Djed this song off the “Studio One Classics” LP by Soul Jazz where it sounds fine but still has background hiss as its likely transferred from the original stampers at best.",
    "photo": "img/97.jpg",
    "year": "1967"
  },
  {
    "name": "Rub A Dub Style",
    "artist": "Michigan and Smiley",
    "description": "Good original pressing, surprisingly the 7” has less surface noise than the original 12” pressing . The 12” adds an additional DJ verse on the end but I prefer the shortened 7” cut in this case. A Classic tune that is always fit for a party. The next cut to Alton Ellis’ “I’m Just A Guy”.",
    "photo": "img/141.jpg",
    "year": "1979"
  },
  {
    "name": "Nice Up The Dance",
    "artist": "Michigan and Smiley",
    "description": "A classic tune by the original DJ duo on the eternal “Real Rock” riddim. This is the first US pressing, which sounds good. If you want it super clean play it off “Studio One Story” (Soul Jazz).",
    "photo": "img/117.jpg",
    "year": "1979"
  },
  {
    "name": "Mad Mad",
    "artist": "Alton Ellis",
    "description": "A 70s pressing of the original riddim source of the now eternal “Diseases” riddim, recorded in 1968 but not released on 7&quot; until the mid 70s. This copy is loud and fine for djing, but has some press noise, to be expected with any of Coxsone’s 70s pressings.",
    "photo": "img/109.jpg",
    "year": "1968"
  },
  {
    "name": "Party Time",
    "artist": "Heptones",
    "description": "The red and yellow label NYC pressing sounds good with only the slightest of background noise. It worked for me for years. Then I acquired this earlier copy which uses the original WIRL stamper. This late 60s copy honestly plays with slight pressing noise but has a rich loudness to it that is hard to argue with. The original UK pressing is hard to find but is a pretty decent pressing, second to the original Jamaican pressings though for me.This Heptones classic also appears on “Studio One Rocksteady” (Soul Jazz) and “The Best Of Studio One” (Heartbeat) compilations, sounding good in both instances. The Heptones later redid this song for Lee Perry in the 1970s.",
    "photo": "img/125.jpg",
    "year": "1968"
  },
  {
    "name": "Pretty Looks",
    "artist": "Heptones",
    "description": "This is the 80s NYC pressing with the Rosette label. It is the best pressing of this song. For such a foundational song it amazes me Coxsone never put it out as a single in the 1960s. It is one of the top 10 Jamaican songs I’ve played over the years. The riddim and the song are both eternal in their own rights. A pillar of not only Studio One but reggae in general.",
    "photo": "img/128.jpg",
    "year": "1968"
  },
  {
    "name": "Try A Little Tenderness",
    "artist": "Joe White",
    "description": "Joe White could really rock a mean Otis or Sam cover. The UK Bluecat pressing of this Otis Redding cover is not bad but it’s not great either. At 150-200 dollars that pressing is just not worth buying, believe me I learned the hard way. This reissue is choice. It was limited to 300 copies but isn’t expensive and sounds good. I have also DJed this song off the top shelf compilation, “Sugar & Spice”, by Japanese label Rock A Shacka. Rock A Shacka is run out of a Japanese record store, Drum and Bass, where I’ve gotten some serious Studio One originals over the years. The original Jamaican pressing is obscenely rare appearing on the black Coxsone label or a Muzik City blank that pairs Joe White’s best songs, this song and “My Guiding Star” on the same 45. The pressing of “Try A Little Tenderness” is loud and clear with minor background noise.",
    "photo": "img/174.jpg",
    "year": "1968"
  },
  {
    "name": "Love Bump",
    "artist": "Lone Ranger",
    "description": "Lone Ranger’s biggest hit for Studio One has stood the test of time, it’s still getting played consistently decades later. A cornerstone of any retrospective of Studio One, Lone Ranger was one of the best Djs of the early 80s in Jamaica and his work for Coxsone proves this.  This is a good red and yellow label pressing 45, the 12” pressing with the Rosette label is also good. Both are more than suitable for sound system play.",
    "photo": "img/106.jpg",
    "year": "1981"
  },
  {
    "name": "Feeling Nice",
    "artist": "Rolando-Coral And Sound Dimension",
    "description": "Roland Alphonso going to town over the riddim track to Carlton And The Shoe’s “This Feeling”. This original 45 Jamaican pressing is not a good one but unfortunately the stampers seem to be the issue. The 2014 repressing uses the same stampers and is plagued by the same sound issues. This is a seriously deep Roland cut. At one point I got obsessed with Roland’s playing and couldn’t get enough of him. I went through every single he ever released and couldn’t believe I missed this one for so many years. Roland has done a lot of incredible work for Coxsone and this is one of my favorites.",
    "photo": "img/71.jpg",
    "year": "1975"
  },
  {
    "name": "Puppy Love",
    "artist": "Soul Two",
    "description": "In my opinion, the “Ride Me Donkey” Lp is the best Studio One full length. It is so stacked with rocksteady murderers, it’s easy for one to get lost in the fray. I only started fully appreciating how good this song is about 5 years ago. The best way to play this is off either of the 80s US pressings, one of which is pictured here. There is a very rare 12” of “Puppy Love”, which has a more modern mix and sounds wack. Avoid it.",
    "photo": "img/22.jpg",
    "year": "1968"
  },
  {
    "name": "Ride Me Donkey",
    "artist": "Dobby Dobson",
    "description": "Coxsone overdubbed and remixed many classic tracks over the years. Which can be dizzying to sort through for the best version or take. Sometimes the remixing is minor and inconsequential and all versions are dope. This is the case here, any version of “Ride Me Donkey” is a good version. This 45 was released around 1977, while the original take is from the mid to late 1960s when rocksteady was at its peak..This is the only 45 pressing of this song.",
    "photo": "img/136.jpg",
    "year": "1977"
  },
  {
    "name": "Please Be True",
    "artist": "Alexander Henry",
    "description": "The first copy of this I DJed when I was younger was a rare UK copy, which is loud but has pressing noise and distortion, overall not great, also mislabeled on the b-side of a Cables 45 “Got To Find Someone”. I then found the original Jamaican pressing from 1969 with Ken Boothe’s “Pleading” on the other side which also plays with slight surface noise and background hiss but sounds warm. The Jamaican 70s pressing pictured here is pretty comparable and similar although it has different matrix number implying the stamper may have been recut for whatever reason. Either way this leads me to believe the background hiss and noise present on all pressings was inherant in the master tapes. The Coxson pressing is garbage and should be avoided as it uses a separate matrix and stamper. Whatever pressing you find , no Studio One collection is complete without this foundation cut, versioned many times over the years. In my heavy rotation for over a decade.",
    "photo": "img/126.jpg",
    "year": "1969"
  },
  {
    "name": "Feel Like Jumping",
    "artist": "Marcia Griffiths",
    "description": "Original pressings have varying levels of surface noise and pops, with this high in demand original UK blue label pressing among the cleanest. The original black text, red label Jamaican pressing from the late ‘60s sounds don’t sound very good from my experience. Lots of pressing noise on those.  When I first started playing college parties, this was a go-to for me. One of the first songs that showed me the power of Studio One, a tune that really gets people up and going on the dancefloor! The Soul Jazz reissue 45 is of comparable quality to this UK original, but doesn’t play as loud or warm.",
    "photo": "img/72.jpg",
    "year": "1968"
  }
]